In [1]:
import pandas as pd

In [2]:
gdp_rich_data = {"cntry": ["USA", "JPN"],
               "gdp": [100, 110]}

gdp_poor_data = {"cntry": ["TZA", "SAR"],
               "gdp": [25, 50]}

df_one = pd.DataFrame(gdp_rich_data)
df_two = pd.DataFrame(gdp_poor_data)

In [9]:
df_one = df_one.append(df_two, ignore_index = True)

In [10]:
df_one

  cntry  gdp
0   USA  100
1   JPN  110
2   TZA   25
3   SAR   50

In [18]:
gdp_rich_data = {"cntry": ["USA", "JPN"],
               "gdp": [100, 110],
                "cpi": [2, 3]}

gdp_poor_data = {"cntry": ["TZA", "SAR"],
               "gdp_f": [25, 50]}

df_one = pd.DataFrame(gdp_rich_data)
df_two = pd.DataFrame(gdp_poor_data)

In [19]:
df_two

  cntry  gdp_f
0   TZA     25
1   SAR     50

In [20]:
df_one = df_one.append(df_two, ignore_index = True)

In [21]:
df_one

  cntry  cpi    gdp  gdp_f
0   USA  2.0  100.0    NaN
1   JPN  3.0  110.0    NaN
2   TZA  NaN    NaN   25.0
3   SAR  NaN    NaN   50.0

In [22]:
gdp_data = {"cntry": ["USA", "JPN"],
               "gdp": [100, 110]}

cpi_data = {"cntry": ["USA", "JPN"],
               "cpi": [10, 15]}

df_one = pd.DataFrame(gdp_data)
df_two = pd.DataFrame(cpi_data)

In [25]:
df_one

  cntry  gdp
0   USA  100
1   JPN  110

In [26]:
df_two

  cntry  cpi
0   USA   10
1   JPN   15

In [27]:
pd.merge?

In [29]:
# Here is a classic one-to-one merge
combo = pd.merge(df_one, df_two,# left df, right df
                 on='cntry',       # link with cntry
                 how='left')  # Tells us what happend

combo.head()

  cntry  gdp  cpi
0   USA  100   10
1   JPN  110   15

In [30]:
gdp_data = {"cntry": ["USA", "JPN", "BRZ"],
               "gdp": [100, 110, 50]}
cpi_data = {"cntry": ["USA", "JPN", "CHN"],
               "cpi": [10, 15, 8]}
           #"gdp": [100, 110, 75]}

df_one = pd.DataFrame(gdp_data)
df_two = pd.DataFrame(cpi_data)

In [31]:
df_one

  cntry  gdp
0   USA  100
1   JPN  110
2   BRZ   50

In [32]:
df_two

  cntry  cpi
0   USA   10
1   JPN   15
2   CHN    8

In [39]:
# Here is a classic one-to-one merge
combo = pd.merge(df_one, df_two,   # left df, right df
                 how='outer',      # Try the different options, inner, outer, left, right...what happens.
                 on='cntry',       # link with cntry
                 indicator=True)  # Tells us what happend

In [40]:
combo.head()

  cntry    gdp   cpi      _merge
0   USA  100.0  10.0        both
1   JPN  110.0  15.0        both
2   BRZ   50.0   NaN   left_only
3   CHN    NaN   8.0  right_only

In [41]:
gdp_data = {"cntry": ["USA", "JPN","USA", "JPN"],
               "gdp": [100, 110, 95, 105],
           "year": [2017, 2017 , 2016, 2016] }

cpi_data = {"cntry": ["USA", "JPN","USA", "JPN"],
               "cpi": [10, 15, 9, 14],
            "year": [2017, 2017 , 2016, 2016] }

df_one = pd.DataFrame(gdp_data)
df_two = pd.DataFrame(cpi_data)

In [42]:
df_one

  cntry  gdp  year
0   USA  100  2017
1   JPN  110  2017
2   USA   95  2016
3   JPN  105  2016

In [43]:
df_two

  cntry  cpi  year
0   USA   10  2017
1   JPN   15  2017
2   USA    9  2016
3   JPN   14  2016

In [59]:
combo = pd.merge(df_one,df_two, on = ['cntry', 'year'], how = "outer")

In [60]:
combo.head(10)

  cntry  gdp  year  cpi
0   USA  100  2017   10
1   JPN  110  2017   15
2   USA   95  2016    9
3   JPN  105  2016   14

In [61]:
gdp_data = {"cntry": ["USA", "JPN", "BRZ"],
               "gdp": [100, 110, 50]}

state_pop_data = {"cntry": ["USA", "USA", "JPN", "JPN"],
                  "state": ["NY", "AK", "Kyoto", "Tokyo"],
                  "pop": [10, 5, 8, 4]}

df_one = pd.DataFrame(gdp_data)
df_two = pd.DataFrame(state_pop_data)

In [62]:
df_one

  cntry  gdp
0   USA  100
1   JPN  110
2   BRZ   50

In [63]:
df_two

  cntry  state  pop
0   USA     NY   10
1   USA     AK    5
2   JPN  Kyoto    8
3   JPN  Tokyo    4

In [73]:
combo = pd.merge(df_one, df_two,   # left df, right df
                 how='outer',      # Try the different options, inner, outer, left, right...what happens.
                 on='cntry',       # link with cntry
                 indicator=True)

In [74]:
combo.head()

  cntry  gdp  state   pop     _merge
0   USA  100     NY  10.0       both
1   USA  100     AK   5.0       both
2   JPN  110  Kyoto   8.0       both
3   JPN  110  Tokyo   4.0       both
4   BRZ   50    NaN   NaN  left_only

In [75]:
combo.dtypes

cntry       object
gdp          int64
state       object
pop        float64
_merge    category
dtype: object